# <center>  Querying a Walkthrough

Creating a database with a series of tables for some example queries. We will only be able to createa database smaller than 20mb to get around githubs filesize limit.

Database Source: https://www.w3resource.com/sql/sql-table.php

In [3]:
%load_ext sql

In [13]:
%sql sqlite://

'Connected: None@None'

### Creating a Simple Table

In [14]:
%%sql
DROP TABLE IF EXISTS writer;
CREATE TABLE writer (first_name, last_name, year_of_death);
INSERT INTO writer VALUES ('Wiliam','Shakespeare', 1616);
INSERT INTO writer VALUES ('Bertold', 'Brecht', 1956);

Done.
Done.
1 rows affected.
1 rows affected.

[]

### Querying Table

In [6]:
%sql SELECT * FROM writer

Done.

[('Wiliam', 'Shakespeare', 1616), ('Bertold', 'Brecht', 1956)]

In [17]:
%sql SELECT * FROM writer WHERE last_name = 'Shakespeare'

Done.

[('Wiliam', 'Shakespeare', 1616)]

In [19]:
%sql SELECT * FROM writer WHERE year_of_death = 1956

Done.

[('Bertold', 'Brecht', 1956)]

In [23]:
%sql SELECT MIN(year_of_death) FROM writer

Done.

[(1616,)]

##### Assinging Values to Pandas

In [7]:
# assigning query to a variable
result = %sql SELECT * FROM writer

Done.

In [8]:
# view the result of the query via a variable
result

[('Wiliam', 'Shakespeare', 1616), ('Bertold', 'Brecht', 1956)]